[
 {
  "Generic name": "Berberine ",
  "Synonyms": "Berberine, Berberina, Berberine alkaloid, Berberine, Umbellatine, Berberine Chloride Hydrate, Berberine Sulfate Hydrate, Neutral berberine sulfate, Berberine Tannate",
  "Action serving ": "It is also suggested to have potential uses in treating infections, diarrhea, diabetes, HIV, heart failure, high cholesterol, high blood pressure, and some cancers due to its anti-inflammatory, antioxidant, and apoptotic properties",
  "For whom": "For individuals with diabetes, high levels of cholesterol or other fats in the blood, and high blood pressure. It is also used for burns, canker sores, and liver disease",
  "Compatibility": "Berberine may interact with medications used to treat diabetes, heart disease, high cholesterol, high blood pressure, blood thinners, and sedatives",
  "For special groups (pregnant, breastfeeding, children, elderly)": "It is important to consult with a healthcare provider if you are taking insulin, have diabetes or low blood sugar. Additionally, pregnant or nursing women, those with a serious medical condition such as cancer, or anyone using other medications should not use berberine unless recommended by a doctor",
  "Side effects": "Stomach pain, diarrhea, gas, nausea\/vomiting, dizziness, fainting, headache, muscle aches, low blood pressure, slow heart rate, abnormal heart rhythms, allergic reactions"
 },
 {
  "Generic name": "Biotin",
  "Synonyms": "Biotin, Coenzyme R, Vitamin B7, Vitamin H",
  "Pharmacology": "Functions as a coenzyme; involved in carboxylation, transcarboxylation, and decarboxylation reactions of gluconeogenesis, lipogenesis, fatty acid synthesis, propionate metabolism, and the catabolism of leucine",
  "Action serving ": "It improves hair, skin, and nail condition, and also has a beneficial effect on metabolism while normalizing blood glucose levels",
  "For whom": "For hair loss, brittle nails",
  "Remark": "There is no reliable test for detecting low biotin levels, so it is typically identified by its symptoms, which include thinning hair and a red, scaly rash around the eyes, nose, and mouth",
  "Compatibility": "Biotin can interfere with certain lab tests, leading to incorrect results and potential misdiagnosis or inappropriate patient management",
  "For special groups (pregnant, breastfeeding, children, elderly)": "Avoid use for pregnant. Water soluble vitamins cross the placenta ",
  "Side effects": "Signs of an allergic reaction that may include: rash, hives, itching, red, swollen, blistered, or peeling skin with or without fever, wheezing, tightness in the chest or throat, trouble breathing, swallowing, or talking, unusual hoarseness, or swelling of the mouth, face, lips, tongue, or throat"
 },
 {
  "Generic name": "Colloidal silver ",
  "Synonyms": "Colloidal silver, Nano-silver, Silver hydrosol, Ionic silver, Silver nanoparticles",
  "Pharmacology": "Silver binds to reactive groups of proteins, denaturing the protein (including enzymes such as lactate dehydrogenase and glutathione peroxidase) and causing precipitation. Silver has been noted to bind to sulfhydryl, amino, carboxyl, phosphate, and imidazole groups",
  "Action serving ": "It can kill certain germs by destroying proteins",
  "For whom": "For infections, hay fever, skin conditions",
  "Remark": "Silver taken by mouth may cause permanent skin discoloration and brain function problems, and is considered unsafe by the FDA",
  "For special groups (pregnant, breastfeeding, children, elderly)": "Avoid use for pregnant. Silver may cross the placenta.",
  "Side effects": "Argyria (purple-grey colored skin) is a recognized adverse outcome of exposure to colloidal silver. Hematological and neurological toxicities are rare but well-documented"
 },
 {
  "Generic name": "Folic acid",
  "Synonyms": "Folic acid, folacin, Vitamin B9, Folate",
  "Pharmacology": "An exogenous source of folate is required for nucleoprotein synthesis and the maintenance of normal erythropoiesis. Folic acid is the precursor of tetrahydrofolic acid, which is involved as a cofactor for transformylation reactions in the biosynthesis of purines and thymidylates of nucleic acids. Impairment of thymidylate synthesis in patients with folic acid deficiency is thought to account for the defective deoxyribonucleic acid (DNA) synthesis that leads to megaloblast formation and megaloblastic and macrocytic anemias",
  "Action serving ": "Effective in treating megaloblastic anemia due to folic acid deficiency and anemias of nutritional origin, pregnancy, infancy, or childhood.",
  "For whom": "Preventing and treating folate deficiency, high homocysteine levels, and birth defects during pregnancy, as well as for conditions including depression, stroke, and decline in memory and thinking skills",
  "Remark": "Patient taking antibiotics like tetracycline may lead to false low serum and red cell folate levels",
  "Compatibility": "Folic acid may counteract the anticonvulsant effects of phenytoin, potentially necessitating increased doses to maintain control of epilepsy",
  "For special groups (pregnant, breastfeeding, children, elderly)": "Teratogenic Effects. Because studies cannot rule out the possibility of harm, however, folic acid should be used during pregnancy only if clearly needed. Folic acid is excreted in the milk of lactating mothers.",
  "Side effects": "Signs of an allergic reaction, like rash, hives, itching, red, swollen, blistered, or peeling skin with or without fever, wheezing, tightness in the chest or throat, trouble breathing, swallowing, or talking, unusual hoarseness, or swelling of the mouth, face, lips, tongue, or throat, erythema, general malaise, respiratory difficulty, anorexia, nausea, abdominal distention, flatulence, bitter or bad taste, altered sleep patterns, difficulty in concentrating, irritability, overactivity, excitement, mental depression, confusion, impaired judgment, decreased vitamin B12 serum levels"
 },
 {
  "Generic name": "Ginkgo Biloba",
  "Synonyms": "Ginkgo Biloba, Maidenhair tree, Ginkgo Biloba biloba, Abricot Argente Japonais, Adiantifolia, Arbre aux Ecus, Arbre du Ciel, Arbre Fossile, Bai Guo Ye, Baiguo, Extrait de Ginkgo Biloba, Fossil Tree, Graine de Ginkgo Biloba, Herba Ginkgo Biloba Biloba, Japanese Silver Apricot, Kew Tree, Noyer du Japon, Pei Go Su Ye, Salisburia Adiantifolia, Yen Xing, Yinhsing, Arbe aux Quarante Ecus, Extrait de Feuille de Ginkgo Biloba, Ginkgo Biloba Folium ",
  "Pharmacology": "Animal studies have shown that ginkgo biloba works on several neurotransmitter pathways and brain structures. Flavones were shown to inhibit lipid peroxidation; inhibit the uptake of serotonin, dopamine, and norepinephrine; and inhibit platelet aggregation. Terpene lactones may also act as potent antagonists of the platelet-activating factor and may possess anti-ischemic and fibrinolytic effects. They were also shown to downregulate adrenal peripheral benzodiazepine receptors and increase adrenocorticotropic hormone levels. Ginkgo biloba also reversibly inhibits monoamine oxidase A; and modestly inhibits anticholinesterase activity, leading to enhanced cholinergic transmission in the brain",
  "Action serving ": "Improves blood circulation and acts as an antioxidant to slow down changes in the brain. It is used to treat anxiety, certain types of dementia, premenstrual symptoms, vertigo, stroke, schizophrenia, movement disorders, memory problems, tinnitus, high blood pressure, multiple sclerosis, heart disease, and sexual problems caused by taking antidepressants. Other unproven uses include altitude sickness, macular degeneration, attention deficit disorder, dyslexia, vitiligo, migraine, lung disease, high cholesterol, Raynaud's syndrome, Lyme disease, fibromyalgia, chronic fatigue syndrome, blood clots, seasonal allergy, leg pain caused by blood circulation problems, cough, depression, sexual dysfunction in females, asthma, autism spectrum disorder, chronic kidney disease, cocaine dependence, vision problems, hemorrhoids, intestinal parasite infection, wound healing, and certain types of cancers",
  "For whom": "For memory and thought problems, anxiety, vision problems",
  "Remark": "May impact fertility in both sexes, potentially making pregnancy more difficult to achieve",
  "Compatibility": "Ginkgo Biloba is not compatible with certain other herbal and health supplements such as angelica, ginger, garlic, among others. It should not be taken without medical advice when using specific medications such as anticoagulants and NSAIDs",
  "For special groups (pregnant, breastfeeding, children, elderly)": "Special risks:\n- Diabetes\n- Seizures or epilepsy\n- A bleeding or blood clotting disorder\n- An allergy to plants such as poison ivy, poison oak, poison sumac\n- Food allergies\n- A genetic enzyme deficiency called glucose-6-phosphate dehydrogenase (G6PD) deficiency\nGinkgo Biloba is considered likely unsafe to use during pregnancy. Taking Ginkgo Biloba during pregnancy could cause bleeding or premature labor.\nGinkgo Biloba is considered likely unsafe to use if you are nursing a baby.\nDo not give any herbal\/health supplement to a child without medical advice",
  "Side effects": "Stomach pain, nausea, vomiting, dry mouth, diarrhea, constipation, headache, dizziness"
 },
 {
  "Generic name": "Krill oil",
  "Synonyms": "Krill oil",
  "Pharmacology": "Krill Oil, containing omega-3 fatty acids, is used to lower triglyceride levels and is increasing in popularity as a supplement for this purpose. The omega-3 fatty acids in Krill oil are absorbed and carried to the body's cells in phospholipid form. Omega-3 fatty acids, in combination with diet and exercise, can lower the body's production of \"bad\" LDL and triglycerides, and may increase \"good\" HDL cholesterol",
  "Action serving ": "Reduces pain and swelling and also prevents the blood from clotting easily",
  "For whom": "For dry eye, for high levels of triglycerides in the blood, high cholesterol, diabetes, depression",
  "Remark": "The benefits of krill oil seem to come from its omega-3 fatty acid content.",
  "Compatibility": "Avoid eating foods that are high in fat or cholesterol. Krill Oil will not be as effective in lowering your triglycerides if you do not follow the diet plan recommended by your doctor. Avoid drinking alcohol. It can increase triglycerides and may make your condition worse.",
  "For special groups (pregnant, breastfeeding, children, elderly)": "Special risks:\n- Blood clotting disorder or risk of stroke\n- Upcoming surgery or procedure that might increase your risk for bleeding\n- Underactive thyroid\n- Excessive alcohol consumption (more than two drinks per day)\nKrill Oil should not be used in patients with a fish or shrimp allergy, or probably any other type of seafood. People with coagulopathy or taking anticoagulants or other medications should notify their physician prior to taking dietary supplements. Do not use Krill Oil without telling your doctor if you are breast-feeding a baby. Do not give this medication to anyone under 18 years old",
  "Side effects": "Hives, difficulty breathing, swelling of face, lips, tongue, or throat"
 },
 {
  "Generic name": "Melatonin",
  "Synonyms": "Melatonin",
  "Pharmacology": "Melatonin is likely effective for treating circadian rhythm sleep disorders in blind children and adults and has received FDA orphan drug status for this use. It may also be effective for sleep-wake cycle disturbances in children and adolescents with mental retardation, autism, and other central nervous system disorders. Additionally, it could decrease the time to fall asleep in children with developmental disabilities and improve secondary insomnia. Other potential uses include benzodiazepine withdrawal, cluster headache, delayed sleep phase syndrome, primary insomnia, jet lag, nicotine withdrawal, preoperative anxiety and sedation, prostate cancer, solid tumors in combination with IL-2 therapy, sunburn prevention, tardive dyskinesia, and thrombocytopenia associated with cancer and chemotherapy",
  "Action serving ": "Help decrease jet lag, adjust sleep cycles in the blind (non 24-Hour Sleep Wake Disorder, or Non-24), treat shift-work sleep disorders in people with alternating work schedules, for general insomnias",
  "For whom": "For insomnia and improving sleep in different conditions, such as jet lag, for depression, chronic pain, dementia",
  "Compatibility": "Avoid driving or operating machinery for at least 4 hours after taking melatonin, or until the drowsy effects are no longer present.\nAvoid using this medication with other prescription medications, over-the-counter drugs, or dietary supplements without asking your doctor, pharmacist or other healthcare provider.\nAvoid alcohol while taking this medication.\nAvoid coffee, tea, cola, energy drinks, or other products that contain caffeine, as it may counteract the effects of the melatonin.",
  "For special groups (pregnant, breastfeeding, children, elderly)": "Parents may consider using melatonin to help their child who has a trouble falling asleep. Only use this medication for your child under the care of a pediatrician or other medical sleep specialist. Seek advice from your healthcare provider before using any dietary supplement if you are pregnant, nursing, or considering the use of this product in a child under 18 years of age.",
  "Side effects": "Daytime drowsiness, dizziness, weakness, confusion, vivid dreams, nightmares, feeling depressed, anxious, irritable, headache, loss of appetite, diarrhea, nausea, stomach pain, blood pressure changes, joint or back pain, elevated risk for seizures"
 },
 {
  "Generic name": "Vitamin D3",
  "Synonyms": "Vitamin D3, cholecalciferol, ergocalciferol",
  "Pharmacology": "The main two biologically active forms of vitamin D are produced in two steps in the body. First, vitamin D3 undergoes hydroxylation in the liver to produce 25-hydroxyvitamin D, and then it undergoes another hydroxylation in the kidneys to generate 1,25-dihydroxyvitamin D. These vitamin D metabolites help in calcium and phosphorus absorption in the small intestine, leading to an increase in serum calcium and phosphate levels, promoting bone mineralization. They also aid in mobilizing calcium and phosphate from bones and potentially increase calcium and phosphate reabsorption through the kidneys. There is a delay of 10 to 24 hours between the administration of cholecalciferol and its effects in the body due to the need for synthesis of active vitamin D metabolites in the liver and kidneys. The regulation of this metabolism at the renal level is controlled by parathyroid hormone",
  "Action serving ": "Treatment of refractory rickets, hypoparathyroidism, and familial hypophosphatemia, as well as osteoporosis and chronic kidney disease.",
  "For whom": "To treat and prevent vitamin D deficiency, for weak and brittle bones, heart disease, asthma, hay fever",
  "Remark": "You should not take cholecalciferol if you have had an allergic reaction to vitamin D, or if you have high levels of calcium or vitamin D in your body, or any condition that makes it hard for your body to absorb nutrients from food (malabsorption)",
  "Compatibility": "Certain medications can make it harder for your body to absorb vitamin D. If you take other medications, take them at least 2 hours before or 2 hours after you take cholecalciferol",
  "For special groups (pregnant, breastfeeding, children, elderly)": "Special risks:\n- Heart disease\n- Kidney disease\n- Electrolyte imbalance",
  "Side effects": "Hives, difficult breathing, swelling of face, lips, tongue or throat; fever, chills, body aches, flu symptoms; chest pain, uneven heartbeats. Less serious side effects: back pain, mild skin rash, fishy aftertaste or belching in some patients"
 }
]